"""
Представления

Для отображения элементов модели предназначены следующие классы представлений:
♦ QListView - простой список с возможностью выбора как одного, так и нескольких
пунктов. Пункты списка, помимо текстовой надписи, могут содержать значки;
♦ QTableView - таблица;
♦ QTreeView - иерархический список.
Также можно воспользоваться классами QComboBox, QListWidget (простой список),
QTableWidget (таблица) и QTreeWidget (иерархический список). Последние три
класса нарушают концепцию «модель-представление», хотя и отчасти базируются
на ней. За подробной информацией по этим классам обращайтесь к документации.
"""

# примеры см в конкретных представлениях
